{
	"about": "about",
	"career": "career",
	"resume": "resume",
	"january": "January",
	"february": "February",
	"march": "March",
	"april": "April",
	"may": "May",
	"june": "June",
	"july": "July",
	"august": "August",
	"september": "September",
	"october": "October",
	"november": "November",
	"december": "December",
	"present": "Present",
	"greeting": "Emilien Vallot",
	"greeting-subtitle-1": "Software Engineer with",
	"greeting-subtitle-2": "years of professional experience building C++ software and tools on Windows, Linux and macOS.",
	"about-1": "Passionate about developing and automating things. It all started back in 2003.",
	"about-2": "At that time, I was already programming in assembly to make 4 levels of gray drawings on my HP40g calculator, but I wanted to become 3D graphic designer.",
	"about-3": "Unfortunately, it didn't work out and I thought to myself:",
	"about-4": "Maybe I can develop tools for graphic designers?!",
	"about-5": "This explains my background, focused on digital imaging, computer vision and later virtual reality.",
	"about-6": "Since then, I've been developing software and tools in several industries such as film, architecture, videography, robotics or even professional audio.",
	"about-7": "I'm always looking for new challenges and things to learn.",
	"about-8": "When I'm not coding, I also enjoy reading, going to the movies, drawing, juggling and photography!",
	"career-1": "All these years allowed me to gather a wide range of skills.",
	"career-2": "My first experience at TechViz during which my knowledge in C, C ++, CPU, GPU and 3D optimization in general (OpenGL, GLSH, DirectX, HLSL, linear algebra, ..) greatly improved. Likewise in other areas such as TCP / UDP networking, hardware device integration, third party assembly code analysis (oops!), CPU / GPU bottleneck detection + optimization, very instructive! In a team of about ten people, excellent first experience.",
	"career-3": "I left for a dream job at SolidAnim. Working closely with graphics designers, helping them getting their job done! I strengthened my C++, Qt5, linear algebra, networking and multi-threading skills. An extraordinary experience that allowed me to discover film sets, and also because the R&D team was free to make technical choices as long as the results were there, I really enjoyed working here.",
	"career-4": "Their move to Bordeaux brought me to L-Acoustics. With passionate people, always up to date on a technical level. Here I was able to update my C++17, CMake, Qt, networking, Jenkins and build systems knowledge, I was also able to bring my 3D expertise for the visualization of acoustic simulations. Great opportunity to work in this area.",
	"career-5": "After a few years, a stint at Abvent and the opportunity to return to the world of 3D. Again, the R&D team was free to make technical choices so we had full controll of the development process (C++17, CMake, Metal, OpenGL, CI, ...). Working with state of the art real-time GPU rendering pipelines was something I really appreciated.",
	"career-6": "And here we are, currently at Fuzzy Logic Robotics a dynamic startup, working on Fuzzy Studio, looking forward to my next challenges!",
	"resume-education-title": "Education",
	"resume-education-item-1-diploma": "Master's Degree in Computer Science Engineering",
	"resume-education-item-1-institute": "University of Technology of Belfort-Montbéliard",
	"resume-education-item-1-studies": "Image, Interaction and Virtual Reality",
	"resume-education-item-2-diploma": "Associate's Degree in Computer Science",
	"resume-education-item-2-institute": "University Institute of Technology of Reims-Châlons-Charleville",
	"resume-education-item-2-studies": "Digital Imaging and Computer Vision",
	"resume-education-item-3-diploma": "High-School Diploma",
	"resume-education-item-3-institute": "Roosevelt High-School",
	"resume-education-item-3-studies": "Engineering Sciences",
	"resume-experience-title": "Professional Experience",
	"resume-experience-item-1-title": "Software Engineer",
	"resume-experience-item-1-desc": "Fuzzy Studio let quickly and visually create robot trajectories without prior knowledge in robotics.",
	"resume-experience-item-1-li-1": "Lead application architect - codebase refactoring ; team management",
	"resume-experience-item-1-li-2": "Improvements and maintenance of the 3D engine based on OSG and its QML integration",
	"resume-experience-item-1-li-3": "Improvements and debugging of the core C/C++ engine",
	"resume-experience-item-1-li-4": "Welding automation: point cloud capture, seam detection, user validation / edition, leading to automated welding execution",
	"resume-experience-item-2-title": "R&D Engineer",
	"resume-experience-item-2-desc": "The R&D team is pioneer in developing photorealistic 3D architectural visualization software.",
	"resume-experience-item-2-li-1": "Technical lead of the development of Artlantis next-gen",
	"resume-experience-item-2-li-2": "Design of the project core architecture",
	"resume-experience-item-2-li-3": "Design of the file format for local and remote on the fly data chunk loading",
	"resume-experience-item-2-li-4": "Lua binding of the engine for unit tests and live control of the engine",
	"resume-experience-item-2-li-5": "Setup of build, test, CI and delivery process for Windows and macOS",
	"resume-experience-item-3-title": "Software Engineer",
	"resume-experience-item-3-desc": "The software team is responsible of providing a suite of software that helps designing and optimizing a venue and then to configure and control the entire system in real-time.",
	"resume-experience-item-3-li-1": "Optimized acoustic simulations using GPGPU for high-performance",
	"resume-experience-item-3-li-2": "Maintenance and improvements of the real-time amplifier manager software",
	"resume-experience-item-3-li-3": "Qt5 introduction in the historical software developed in Juce",
	"resume-experience-item-3-li-4": "Development and integration of standalone Qt5 components dedicated for the new products",
	"resume-experience-item-3-li-5": "Development of Hive on my spare-time ; open source AVB controller",
	"resume-experience-item-4-title": "R&D Engineer",
	"resume-experience-item-4-desc": "The R&D team provides an innovative previz and augmented reality solution that allows markerless real-time tracking of all kind of cameras and visual effects preview in real-time while shooting a movie of broadcast show.",
	"resume-experience-item-4-li-1": "Maintenance and improvements of the SLAM algorithm and software",
	"resume-experience-item-4-li-2": "Improvement of virtual world setup (origin, scale, ..)",
	"resume-experience-item-4-li-3": "Development of tools for calibrating cinema and broadcast optics",
	"resume-experience-item-4-li-4": "Development of video input plugins for Unity, MotionBuilder and UnrealEngine",
	"resume-experience-item-4-li-5": "Development of a distributed scene for data broadcast to 3rd party rendering software",
	"resume-experience-item-4-li-6": "Development of an Arduino firmware that synchronizes metadata (timecode, video, gyroscope, ..)",
	"resume-experience-item-5-title": "R&D Engineer",
	"resume-experience-item-5-desc": "The R&D team provides a cutting edge technology for 3D rendering and cluster computing for virtually any third party 3D software, it acts as a driver for any virtual reality system.",
	"resume-experience-item-5-li-1": "Integration and certification of new software (3D matrix correction, data optimization)",
	"resume-experience-item-5-li-2": "Integration of virtual reality devices (ART, Oculus, ..)",
	"resume-experience-item-5-li-3": "Development of a real-time warping module for non-planar surface projection",
	"resume-experience-item-5-li-4": "Development of various productivity tools for testing and debugging",
	"resume-experience-item-5-li-5": "Refactoring and optimization of the core engine",
	"resume-experience-item-5-li-6": "System installation at customers"
}