{
	"about": "à propos",
	"career": "parcours",
	"resume": "curriculum",
	"january": "Janvier",
	"february": "Février",
	"march": "Mars",
	"april": "Avril",
	"may": "Mai",
	"june": "Juin",
	"july": "Juillet",
	"august": "Août",
	"september": "Septembre",
	"october": "Octobre",
	"november": "Novembre",
	"december": "Décembre",
	"present": "Aujourd'hui",
	"greeting": "Emilien Vallot",
	"greeting-subtitle-1": "Ingénieur logiciel depuis",
	"greeting-subtitle-2": "ans, experimenté dans la création de logiciels et d'outils C++ sous Windows, Linux et macOS.",
	"about-1": "Féru de développement et d'automatisation. Tout a commencé en 2003.",
	"about-2": "À cette époque, je programmais déjà en assembleur pour dessiner des images en 4 niveaux de gris sur ma calculatrice HP40g, mais je voulais devenir graphiste 3D.",
	"about-3": "Malheureusement, ça n'a pas fonctionné et je me suis dit :",
	"about-4": "Peut-être que je peux développer des outils pour les graphistes ?!",
	"about-5": "Cela explique mon parcours, orienté vers l'imagerie numérique, la vision par ordinateur et plus tard la réalité virtuelle.",
	"about-6": "Depuis, j'ai développé des logiciels et des outils dans plusieurs secteurs tels que le cinéma, l'architecture, le traitement vidéo, la robotique ou encore l'audio professionnel.",
	"about-7": "Insatiable, sans cesse à la recherche de nouveaux défis et choses à apprendre.",
	"about-8": "Quand je ne code pas, je lis, je vais au cinéma, je dessine, jongle et fais de la photographie !",
	"career-1": "Toutes ces années m'ont permis de rassembler un large éventail de compétences.",
	"career-2": "Ma première expérience chez TechViz durant laquelle mes connaissances en C, C++, optimisation CPU, GPU et 3D en général (OpenGL, GLSH, DirectX, HLSL, algèbre linéaire, ..) se sont grandement améliorées. De même dans d'autres domaines comme le réseau TCP/UDP, l'intégration de périphériques matériels, l'analyse de code assembleur tiers (oops!), la détection + optimisation des goulots d'étranglement niveau CPU/GPU, très formateur ! Dans une équipe d'une dizaine de personnes environ, excellente première expérience.",
	"career-3": "Je suis parti pour un poste de rêve chez SolidAnim. En étroite collaboration avec des graphistes pour les aider à faire leur travail ! J'y ai renforcé mes compétences en C++, Qt5, algèbre linéaire, réseau et multi-threading. Une expérience hors du commun qui m'a permis de découvrir les plateaux de tournage, et aussi car l'équipe R&D était libre de ses choix techniques tant que les résultats étaient là. J'ai vraiment aimé travailler ici.",
	"career-4": "Leur démenagement à Bordeaux m'a conduit chez L-Acoustics. Avec des gens passionnés, toujours à jour sur le plan technique. A cette occasion, j'ai pu me mettre à jour niveau C++17, amélioré mes connaissances sur CMake, Qt, le réseau, Jenkins et systèmes de build. Mon expertise 3D constitua un avantage certain pour la visualisation de simulations acoustiques. Belle opportunité de travailler dans ce domaine.",
	"career-5": "Après quelques années, un passage chez Abvent et l'occasion de retourner vers le monde de la 3D. Encore une fois, l'équipe de R&D était libre de ses choix techniques, nous avions le contrôle total du processus de développement (C++17, CMake, Metal, OpenGL, CI, ..). Travailler sur des pipelines de rendu GPU en temps réel de pointe était quelque chose que j'ai vraiment apprécié.",
	"career-6": "Et nous y voilà, actuellement chez Fuzzy Logic Robotics une startup dynamique, travaillant sur Fuzzy Studio, dans l'attente de mes prochains défis !",
	"resume-education-title": "Formation",
	"resume-education-item-1-diploma": "Ingénieur en Informatique",
	"resume-education-item-1-institute": "Université de Technologie de Belfort-Montbéliard",
	"resume-education-item-1-studies": "Image, Interaction et Réalité Virtuelle",
	"resume-education-item-2-diploma": "Diplôme Universitaire de Technologie",
	"resume-education-item-2-institute": "IUT de Reims-Châlons-Charleville",
	"resume-education-item-2-studies": "Imagerie Numérique",
	"resume-education-item-3-diploma": "Baccalauréat Scientifique",
	"resume-education-item-3-institute": "Lycée Roosevelt",
	"resume-education-item-3-studies": "Sciences de l'Ingénieur",
	"resume-experience-title": "Expérience professionnelle",
	"resume-experience-item-1-title": "Ingénieur Software",
	"resume-experience-item-1-desc": "Fuzzy Studio permet de créer rapidement et visuellement des trajectoires sur des robots, sans connaissances préalables en robotique.",
	"resume-experience-item-1-li-1": "Lead architecte - Refactoring du code existant ; Management de l'équipe de développement",
	"resume-experience-item-1-li-2": "Amélioration et maintenance du moteur de rendu 3D basé sur OSG et son intégration en QML",
	"resume-experience-item-1-li-3": "Amélioration et débogage du coeur de l'application en C/C++",
	"resume-experience-item-2-title": "Ingénieur R&D",
	"resume-experience-item-2-desc": "L'équipe R&D est pionnière dans le développement de logiciels de visualisation architecturale 3D photoréalistes.",
	"resume-experience-item-2-li-1": "Responsable technique du développement d'Artlantis next-gen",
	"resume-experience-item-2-li-2": "Conception de l'architecture de base du projet",
	"resume-experience-item-2-li-3": "Conception du format de fichier pour le chargement de blocs de données locaux et distants à la volée",
	"resume-experience-item-2-li-4": "Binding du moteur en Lua pour les tests unitaires et contrôle en moteur en direct",
	"resume-experience-item-2-li-5": "Mise en place du build, des tests, de la CI et de livraison des binaires pour Windows et macOS",
	"resume-experience-item-3-title": "Ingénieur Software",
	"resume-experience-item-3-desc": "L'équipe soft est chargée de fournir une suite de logiciels qui aident à concevoir et à optimiser les salles de concert, puis à configurer et contrôler l'ensemble du système en temps réel.",
	"resume-experience-item-3-li-1": "Maintenance et améliorations du logiciel de simulation acoustique 3D",
	"resume-experience-item-3-li-2": "Maintenance et améliorations du logiciel de gestion des amplifis en temps réel",
	"resume-experience-item-3-li-3": "Introduction de Qt5 dans le logiciel historique développé en Juce",
	"resume-experience-item-3-li-4": "Développement et intégration de composants Qt5 autonomes dédiés pour les nouveaux produits",
	"resume-experience-item-3-li-5": "Développement de Hive sur mon temps libre ; contrôleur AVB open source",
	"resume-experience-item-4-title": "Ingénieur R&D",
	"resume-experience-item-4-desc": "L'équipe de R&D fournit une solution innovante de prévisualisation et de réalité augmentée qui permet un suivi en temps réel sans marqueur de toutes sortes de caméras et un d'afficher des effets spéciaux en temps réel lors du tournage d'un film ou d'une émission télé.",
	"resume-experience-item-4-li-1": "Maintenance et améliorations de l'algorithme et du logiciel de SLAM",
	"resume-experience-item-4-li-2": "Amélioration de configuration du monde virtuel (origine, échelle, ..)",
	"resume-experience-item-4-li-3": "Développement d'outils de calibrage des optiques cinéma et broadcast",
	"resume-experience-item-4-li-4": "Développement de plugins d'entrée vidéo pour Unity, MotionBuilder et UnrealEngine",
	"resume-experience-item-4-li-5": "Développement d'une scene distribuée pour la diffusion de données vers des logiciels de rendu tiers",
	"resume-experience-item-4-li-6": "Développement d'un firmware Arduino synchronisant les métadonnées (timecode, vidéo, gyroscope, ..)",
	"resume-experience-item-5-title": "Ingénieur R&D",
	"resume-experience-item-5-desc": "L'équipe R&D fournit une technologie de pointe pour le rendu 3D et le rendu sur cluster pour pratiquement tous les logiciels 3D tiers, elle agit comme un pilote pour tout système de réalité virtuelle.",
	"resume-experience-item-5-li-1": "Intégration et certification de nouveaux logiciels (correction matricielle 3D, optimisation des données)",
	"resume-experience-item-5-li-2": "Intégration de dispositifs de réalité virtuelle (ART, Oculus, ..)",
	"resume-experience-item-5-li-3": "Développement d'un module de déformation en temps réel pour la projection de surfaces non planes",
	"resume-experience-item-5-li-4": "Développement de plusieurs outils de productivité pour les tests et le débogage",
	"resume-experience-item-5-li-5": "Refactoring et optimisation du moteur principal",
	"resume-experience-item-5-li-6": "Installation du système chez les clients"
}